Tekla Open API Reference for Tekla Structures 2025
Events.ViewClosed Event
 Occurs when view is closed.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.ViewClosedDelegate ViewClosed
Public Event ViewClosed As Events.ViewClosedDelegate
Value
Type: Tekla.Structures.Model.Events.ViewClosedDelegate
See Also
Reference
Events Class
Tekla.Structures.Model Namespace